qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402kx.h
/* Legacy defines */
#define PWC_CTRL_PVMSEL_2V3                 PWC_CTRL_PVMSEL_LEV1
#define PWC_CTRL_PVMSEL_2V4                 PWC_CTRL_PVMSEL_LEV2
#define PWC_CTRL_PVMSEL_2V5                 PWC_CTRL_PVMSEL_LEV3
#define PWC_CTRL_PVMSEL_2V6                 PWC_CTRL_PVMSEL_LEV4
#define PWC_CTRL_PVMSEL_2V7                 PWC_CTRL_PVMSEL_LEV5
#define PWC_CTRL_PVMSEL_2V8                 PWC_CTRL_PVMSEL_LEV6
#define PWC_CTRL_PVMSEL_2V9                 PWC_CTRL_PVMSEL_LEV7

#define PWC_CTRL_BPWEN_Pos                  (8U)
#define PWC_CTRL_BPWEN_Msk                  (0x1U << PWC_CTRL_BPWEN_Pos)            /*!< 0x00000100 */
#define PWC_CTRL_BPWEN                      PWC_CTRL_BPWEN_Msk                      /*!< Battery powered domain write enable */

/*****************  Bit definition for PWC_CTRLSTS register  ******************/
#define PWC_CTRLSTS_SWEF_Pos                (0U)
#define PWC_CTRLSTS_SWEF_Msk                (0x1U << PWC_CTRLSTS_SWEF_Pos)          /*!< 0x00000001 */
#define PWC_CTRLSTS_SWEF                    PWC_CTRLSTS_SWEF_Msk                    /*!< Standby wake-up event flag */
#define PWC_CTRLSTS_SEF_Pos                 (1U)
#define PWC_CTRLSTS_SEF_Msk                 (0x1U << PWC_CTRLSTS_SEF_Pos)           /*!< 0x00000002 */
#define PWC_CTRLSTS_SEF                     PWC_CTRLSTS_SEF_Msk                     /*!< Standby mode entry flag */
#define PWC_CTRLSTS_PVMOF_Pos               (2U)
#define PWC_CTRLSTS_PVMOF_Msk               (0x1U << PWC_CTRLSTS_PVMOF_Pos)         /*!< 0x00000004 */
#define PWC_CTRLSTS_PVMOF                   PWC_CTRLSTS_PVMOF_Msk                   /*!< Power voltage monitoring output flag */
#define PWC_CTRLSTS_SWPEN1_Pos              (8U)
#define PWC_CTRLSTS_SWPEN1_Msk              (0x1U << PWC_CTRLSTS_SWPEN1_Pos)        /*!< 0x00000100 */
#define PWC_CTRLSTS_SWPEN1                  PWC_CTRLSTS_SWPEN1_Msk                  /*!< Standby wake-up pin 1 enable */
#define PWC_CTRLSTS_SWPEN2_Pos              (9U)
#define PWC_CTRLSTS_SWPEN2_Msk              (0x1U << PWC_CTRLSTS_SWPEN2_Pos)        /*!< 0x00000200 */
#define PWC_CTRLSTS_SWPEN2                  PWC_CTRLSTS_SWPEN2_Msk                  /*!< Standby wake-up pin 2 enable */
#define PWC_CTRLSTS_SWPEN6_Pos              (13U)
#define PWC_CTRLSTS_SWPEN6_Msk              (0x1U << PWC_CTRLSTS_SWPEN6_Pos)        /*!< 0x00002000 */
#define PWC_CTRLSTS_SWPEN6                  PWC_CTRLSTS_SWPEN6_Msk                  /*!< Standby wake-up pin 6 enable */

/******************  Bit definition for PWC_LDOOV register  *******************/
/*!< LDOOVSEL congiguration */
#define PWC_LDOOV_LDOOVSEL_Pos              (0U)
#define PWC_LDOOV_LDOOVSEL_Msk              (0x3U << PWC_LDOOV_LDOOVSEL_Pos)        /*!< 0x00000003 */
#define PWC_LDOOV_LDOOVSEL                  PWC_LDOOV_LDOOVSEL_Msk                  /*!< LDOOVSEL[1:0] bits (Voltage regulator output voltage select) */
#define PWC_LDOOV_LDOOVSEL_0                (0x1U << PWC_LDOOV_LDOOVSEL_Pos)        /*!< 0x00000001 */
#define PWC_LDOOV_LDOOVSEL_1                (0x2U << PWC_LDOOV_LDOOVSEL_Pos)        /*!< 0x00000002 */

#define PWC_LDOOV_LDOOVSEL_LEV0             0x00000000U                             /*!< Voltage output level 1.0V */
#define PWC_LDOOV_LDOOVSEL_LEV2             0x00000002U                             /*!< Voltage output level 1.2V */
#define PWC_LDOOV_LDOOVSEL_LEV3             0x00000003U                             /*!< Voltage output level 1.3V */

/* Legacy defines */
#define PWC_LDOOV_LDOOVSEL_1V0              PWC_LDOOV_LDOOVSEL_LEV0
#define PWC_LDOOV_LDOOVSEL_1V2              PWC_LDOOV_LDOOVSEL_LEV2
#define PWC_LDOOV_LDOOVSEL_1V3              PWC_LDOOV_LDOOVSEL_LEV3

#define PWC_LDOOV_VREXLPEN_Pos              (4U)
#define PWC_LDOOV_VREXLPEN_Msk              (0x1U << PWC_LDOOV_VREXLPEN_Pos)        /*!< 0x00000010 */
#define PWC_LDOOV_VREXLPEN                  PWC_LDOOV_VREXLPEN_Msk                  /*!< Voltage regulator extra low power mode enable */

/******************************************************************************/
/*                                                                            */
/*                        Clock and reset manage (CRM)                        */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CRM_CTRL register  *******************/
#define CRM_CTRL_HICKEN_Pos                 (0U)
#define CRM_CTRL_HICKEN_Msk                 (0x1U << CRM_CTRL_HICKEN_Pos)           /*!< 0x00000001 */
#define CRM_CTRL_HICKEN                     CRM_CTRL_HICKEN_Msk                     /*!< High speed internal clock enable */
#define CRM_CTRL_HICKSTBL_Pos               (1U)
#define CRM_CTRL_HICKSTBL_Msk               (0x1U << CRM_CTRL_HICKSTBL_Pos)         /*!< 0x00000002 */
#define CRM_CTRL_HICKSTBL                   CRM_CTRL_HICKSTBL_Msk                   /*!< High speed internal clock stable */
#define CRM_CTRL_HICKTRIM_Pos               (2U)
#define CRM_CTRL_HICKTRIM_Msk               (0x3FU << CRM_CTRL_HICKTRIM_Pos)        /*!< 0x000000FC */
#define CRM_CTRL_HICKTRIM                   CRM_CTRL_HICKTRIM_Msk                   /*!< High speed internal clock trimming */
#define CRM_CTRL_HICKCAL_Pos                (8U)
#define CRM_CTRL_HICKCAL_Msk                (0xFFU << CRM_CTRL_HICKCAL_Pos)         /*!< 0x0000FF00 */
#define CRM_CTRL_HICKCAL                    CRM_CTRL_HICKCAL_Msk                    /*!< High speed internal clock calibration */
#define CRM_CTRL_HEXTEN_Pos                 (16U)
#define CRM_CTRL_HEXTEN_Msk                 (0x1U << CRM_CTRL_HEXTEN_Pos)           /*!< 0x00010000 */
#define CRM_CTRL_HEXTEN                     CRM_CTRL_HEXTEN_Msk                     /*!< High speed external crystal enable */
#define CRM_CTRL_HEXTSTBL_Pos               (17U)
#define CRM_CTRL_HEXTSTBL_Msk               (0x1U << CRM_CTRL_HEXTSTBL_Pos)         /*!< 0x00020000 */
#define CRM_CTRL_HEXTSTBL                   CRM_CTRL_HEXTSTBL_Msk                   /*!< High speed external crystal stable */
#define CRM_CTRL_HEXTBYPS_Pos               (18U)
#define CRM_CTRL_HEXTBYPS_Msk               (0x1U << CRM_CTRL_HEXTBYPS_Pos)         /*!< 0x00040000 */
#define CRM_CTRL_HEXTBYPS                   CRM_CTRL_HEXTBYPS_Msk                   /*!< High speed external crystal bypass */
#define CRM_CTRL_CFDEN_Pos                  (19U)
#define CRM_CTRL_CFDEN_Msk                  (0x1U << CRM_CTRL_CFDEN_Pos)            /*!< 0x00080000 */
#define CRM_CTRL_CFDEN                      CRM_CTRL_CFDEN_Msk                      /*!< Clock failure detector enable */
#define CRM_CTRL_PLLEN_Pos                  (24U)
#define CRM_CTRL_PLLEN_Msk                  (0x1U << CRM_CTRL_PLLEN_Pos)            /*!< 0x01000000 */
#define CRM_CTRL_PLLEN                      CRM_CTRL_PLLEN_Msk                      /*!< PLL enable */
#define CRM_CTRL_PLLSTBL_Pos                (25U)
#define CRM_CTRL_PLLSTBL_Msk                (0x1U << CRM_CTRL_PLLSTBL_Pos)          /*!< 0x02000000 */
#define CRM_CTRL_PLLSTBL                    CRM_CTRL_PLLSTBL_Msk                    /*!< PLL clock stable */
#define CRM_CTRL_PLLUSTBL_Pos               (26U)
#define CRM_CTRL_PLLUSTBL_Msk               (0x1U << CRM_CTRL_PLLUSTBL_Pos)         /*!< 0x04000000 */
#define CRM_CTRL_PLLUSTBL                   CRM_CTRL_PLLUSTBL_Msk                   /*!< PLLU clock stable */

/******************  Bit definition for CRM_PLLCFG register  ******************/
/*!< PLL_MS congiguration */
#define CRM_PLLCFG_PLL_MS_Pos               (0U)
#define CRM_PLLCFG_PLL_MS_Msk               (0xFU << CRM_PLLCFG_PLL_MS_Pos)         /*!< 0x0000000F */
#define CRM_PLLCFG_PLL_MS                   CRM_PLLCFG_PLL_MS_Msk                   /*!< PLL_MS[3:0] bits (PLL pre-division) */
#define CRM_PLLCFG_PLL_MS_0                 (0x1U << CRM_PLLCFG_PLL_MS_Pos)         /*!< 0x00000001 */
#define CRM_PLLCFG_PLL_MS_1                 (0x2U << CRM_PLLCFG_PLL_MS_Pos)         /*!< 0x00000002 */
#define CRM_PLLCFG_PLL_MS_2                 (0x4U << CRM_PLLCFG_PLL_MS_Pos)         /*!< 0x00000004 */
#define CRM_PLLCFG_PLL_MS_3                 (0x8U << CRM_PLLCFG_PLL_MS_Pos)         /*!< 0x00000008 */

/*!< PLL_NS congiguration */
#define CRM_PLLCFG_PLL_NS_Pos               (6U)
#define CRM_PLLCFG_PLL_NS_Msk               (0x1FFU << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00007FC0 */
#define CRM_PLLCFG_PLL_NS                   CRM_PLLCFG_PLL_NS_Msk                   /*!< PLL_NS[8:0] bits (PLL multiplication factor) */
#define CRM_PLLCFG_PLL_NS_0                 (0x001U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000040 */
#define CRM_PLLCFG_PLL_NS_1                 (0x002U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000080 */
#define CRM_PLLCFG_PLL_NS_2                 (0x004U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000100 */
#define CRM_PLLCFG_PLL_NS_3                 (0x008U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000200 */
#define CRM_PLLCFG_PLL_NS_4                 (0x010U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000400 */
#define CRM_PLLCFG_PLL_NS_5                 (0x020U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000800 */
#define CRM_PLLCFG_PLL_NS_6                 (0x040U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00001000 */
#define CRM_PLLCFG_PLL_NS_7                 (0x080U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00002000 */
#define CRM_PLLCFG_PLL_NS_8                 (0x100U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00004000 */

/*!< PLL_FP congiguration */
#define CRM_PLLCFG_PLL_FP_Pos               (16U)
#define CRM_PLLCFG_PLL_FP_Msk               (0xFU << CRM_PLLCFG_PLL_FP_Pos)         /*!< 0x000F0000 */
#define CRM_PLLCFG_PLL_FP                   CRM_PLLCFG_PLL_FP_Msk                   /*!< PLL_FP[3:0] bits (PLLP post-division) */
#define CRM_PLLCFG_PLL_FP_0                 (0x1U << CRM_PLLCFG_PLL_FP_Pos)         /*!< 0x00010000 */
#define CRM_PLLCFG_PLL_FP_1                 (0x2U << CRM_PLLCFG_PLL_FP_Pos)         /*!< 0x00020000 */
#define CRM_PLLCFG_PLL_FP_2                 (0x4U << CRM_PLLCFG_PLL_FP_Pos)         /*!< 0x00040000 */
#define CRM_PLLCFG_PLL_FP_3                 (0x8U << CRM_PLLCFG_PLL_FP_Pos)         /*!< 0x00080000 */

/*!< PLL_FU congiguration */
#define CRM_PLLCFG_PLL_FU_Pos               (20U)
#define CRM_PLLCFG_PLL_FU_Msk               (0x7U << CRM_PLLCFG_PLL_FU_Pos)         /*!< 0x00700000 */
#define CRM_PLLCFG_PLL_FU                   CRM_PLLCFG_PLL_FU_Msk                   /*!< PLL_FU[2:0] bits (PLLU post-division) */
#define CRM_PLLCFG_PLL_FU_0                 (0x1U << CRM_PLLCFG_PLL_FU_Pos)         /*!< 0x00100000 */
#define CRM_PLLCFG_PLL_FU_1                 (0x2U << CRM_PLLCFG_PLL_FU_Pos)         /*!< 0x00200000 */
#define CRM_PLLCFG_PLL_FU_2                 (0x4U << CRM_PLLCFG_PLL_FU_Pos)         /*!< 0x00400000 */

