qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402kx.h
/*!< CLKOUT_SEL2 congiguration */
#define CRM_MISC1_CLKOUT_SEL2_Pos           (16U)
#define CRM_MISC1_CLKOUT_SEL2_Msk           (0xFU << CRM_MISC1_CLKOUT_SEL2_Pos)     /*!< 0x000F0000 */
#define CRM_MISC1_CLKOUT_SEL2               CRM_MISC1_CLKOUT_SEL2_Msk               /*!< CLKOUT_SEL2[3:0] bits (Clock output selection 2) */
#define CRM_MISC1_CLKOUT_SEL2_0             (0x1U << CRM_MISC1_CLKOUT_SEL2_Pos)     /*!< 0x00010000 */
#define CRM_MISC1_CLKOUT_SEL2_1             (0x2U << CRM_MISC1_CLKOUT_SEL2_Pos)     /*!< 0x00020000 */
#define CRM_MISC1_CLKOUT_SEL2_2             (0x4U << CRM_MISC1_CLKOUT_SEL2_Pos)     /*!< 0x00040000 */
#define CRM_MISC1_CLKOUT_SEL2_3             (0x8U << CRM_MISC1_CLKOUT_SEL2_Pos)     /*!< 0x00080000 */

#define CRM_MISC1_CLKOUT_SEL2_USBFS         0x00000000U                             /*!< USBFS 48M */
#define CRM_MISC1_CLKOUT_SEL2_ADC           0x00010000U                             /*!< ADC */
#define CRM_MISC1_CLKOUT_SEL2_HICK          0x00020000U                             /*!< HICK */
#define CRM_MISC1_CLKOUT_SEL2_LICK          0x00030000U                             /*!< LICK */
#define CRM_MISC1_CLKOUT_SEL2_LEXT          0x00040000U                             /*!< LEXT */

/* Reference defines */
#define CRM_MISC1_CLKSEL2                   CRM_MISC1_CLKOUT_SEL2
#define CRM_MISC1_CLKSEL2_0                 CRM_MISC1_CLKOUT_SEL2_0
#define CRM_MISC1_CLKSEL2_1                 CRM_MISC1_CLKOUT_SEL2_1
#define CRM_MISC1_CLKSEL2_2                 CRM_MISC1_CLKOUT_SEL2_2
#define CRM_MISC1_CLKSEL2_3                 CRM_MISC1_CLKOUT_SEL2_3
#define CRM_MISC1_CLKSEL2_USBFS             CRM_MISC1_CLKOUT_SEL2_USBFS
#define CRM_MISC1_CLKSEL2_ADC               CRM_MISC1_CLKOUT_SEL2_ADC
#define CRM_MISC1_CLKSEL2_HICK              CRM_MISC1_CLKOUT_SEL2_HICK
#define CRM_MISC1_CLKSEL2_LICK              CRM_MISC1_CLKOUT_SEL2_LICK
#define CRM_MISC1_CLKSEL2_LEXT              CRM_MISC1_CLKOUT_SEL2_LEXT

/*!< CLKOUTDIV2 congiguration */
#define CRM_MISC1_CLKOUTDIV2_Pos            (28U)
#define CRM_MISC1_CLKOUTDIV2_Msk            (0xFU << CRM_MISC1_CLKOUTDIV2_Pos)      /*!< 0xF0000000 */
#define CRM_MISC1_CLKOUTDIV2                CRM_MISC1_CLKOUTDIV2_Msk                /*!< CLKOUTDIV2[3:0] bits (Clock output division 2) */
#define CRM_MISC1_CLKOUTDIV2_0              (0x1U << CRM_MISC1_CLKOUTDIV2_Pos)      /*!< 0x10000000 */
#define CRM_MISC1_CLKOUTDIV2_1              (0x2U << CRM_MISC1_CLKOUTDIV2_Pos)      /*!< 0x20000000 */
#define CRM_MISC1_CLKOUTDIV2_2              (0x4U << CRM_MISC1_CLKOUTDIV2_Pos)      /*!< 0x40000000 */
#define CRM_MISC1_CLKOUTDIV2_3              (0x8U << CRM_MISC1_CLKOUTDIV2_Pos)      /*!< 0x80000000 */

#define CRM_MISC1_CLKOUTDIV2_DIV1           0x00000000U                             /*!< No clock output */
#define CRM_MISC1_CLKOUTDIV2_DIV2           0x80000000U                             /*!< Clock output divided by 2 */
#define CRM_MISC1_CLKOUTDIV2_DIV4           0x90000000U                             /*!< Clock output divided by 4 */
#define CRM_MISC1_CLKOUTDIV2_DIV8           0xA0000000U                             /*!< Clock output divided by 8 */
#define CRM_MISC1_CLKOUTDIV2_DIV16          0xB0000000U                             /*!< Clock output divided by 16 */
#define CRM_MISC1_CLKOUTDIV2_DIV64          0xC0000000U                             /*!< Clock output divided by 64 */
#define CRM_MISC1_CLKOUTDIV2_DIV128         0xD0000000U                             /*!< Clock output divided by 128 */
#define CRM_MISC1_CLKOUTDIV2_DIV256         0xE0000000U                             /*!< Clock output divided by 256 */
#define CRM_MISC1_CLKOUTDIV2_DIV512         0xF0000000U                             /*!< Clock output divided by 512 */

/******************  Bit definition for CRM_MISC2 register  *******************/
/*!< AUTO_STEP_EN congiguration */
#define CRM_MISC2_AUTO_STEP_EN_Pos          (4U)
#define CRM_MISC2_AUTO_STEP_EN_Msk          (0x3U << CRM_MISC2_AUTO_STEP_EN_Pos)    /*!< 0x00000030 */
#define CRM_MISC2_AUTO_STEP_EN              CRM_MISC2_AUTO_STEP_EN_Msk              /*!< AUTO_STEP_EN[1:0] bits (Auto step-by-step SCLK switch enable) */
#define CRM_MISC2_AUTO_STEP_EN_0            (0x1U << CRM_MISC2_AUTO_STEP_EN_Pos)    /*!< 0x00000010 */
#define CRM_MISC2_AUTO_STEP_EN_1            (0x2U << CRM_MISC2_AUTO_STEP_EN_Pos)    /*!< 0x00000020 */

#define CRM_MISC2_PLLU_USB48_SEL_Pos        (10U)
#define CRM_MISC2_PLLU_USB48_SEL_Msk        (0x1U << CRM_MISC2_PLLU_USB48_SEL_Pos)  /*!< 0x00000400 */
#define CRM_MISC2_PLLU_USB48_SEL            CRM_MISC2_PLLU_USB48_SEL_Msk            /*!< USBFS 48M clock source selection */

/*!< HICK_TO_SCLK_DIV congiguration */
#define CRM_MISC2_HICK_TO_SCLK_DIV_Pos      (16U)
#define CRM_MISC2_HICK_TO_SCLK_DIV_Msk      (0x7U << CRM_MISC2_HICK_TO_SCLK_DIV_Pos) /*!< 0x00070000 */
#define CRM_MISC2_HICK_TO_SCLK_DIV          CRM_MISC2_HICK_TO_SCLK_DIV_Msk           /*!< HICK_TO_SCLK_DIV[2:0] bits (HICK as SCLK frequency division) */
#define CRM_MISC2_HICK_TO_SCLK_DIV_0        (0x1U << CRM_MISC2_HICK_TO_SCLK_DIV_Pos) /*!< 0x00010000 */
#define CRM_MISC2_HICK_TO_SCLK_DIV_1        (0x2U << CRM_MISC2_HICK_TO_SCLK_DIV_Pos) /*!< 0x00020000 */
#define CRM_MISC2_HICK_TO_SCLK_DIV_2        (0x4U << CRM_MISC2_HICK_TO_SCLK_DIV_Pos) /*!< 0x00040000 */

#define CRM_MISC2_HICK_TO_SCLK_DIV_DIV1     0x00000000U                              /*!< HICK */
#define CRM_MISC2_HICK_TO_SCLK_DIV_DIV2     0x00010000U                              /*!< HICK/2 */
#define CRM_MISC2_HICK_TO_SCLK_DIV_DIV4     0x00020000U                              /*!< HICK/4 */
#define CRM_MISC2_HICK_TO_SCLK_DIV_DIV8     0x00030000U                              /*!< HICK/8 */
#define CRM_MISC2_HICK_TO_SCLK_DIV_DIV16    0x00040000U                              /*!< HICK/16 */

/*!< HEXT_TO_SCLK_DIV congiguration */
#define CRM_MISC2_HEXT_TO_SCLK_DIV_Pos      (19U)
#define CRM_MISC2_HEXT_TO_SCLK_DIV_Msk      (0x7U << CRM_MISC2_HEXT_TO_SCLK_DIV_Pos) /*!< 0x00380000 */
#define CRM_MISC2_HEXT_TO_SCLK_DIV          CRM_MISC2_HEXT_TO_SCLK_DIV_Msk           /*!< HEXT_TO_SCLK_DIV[2:0] bits (HEXT as SCLK frequency division) */
#define CRM_MISC2_HEXT_TO_SCLK_DIV_0        (0x1U << CRM_MISC2_HEXT_TO_SCLK_DIV_Pos) /*!< 0x00080000 */
#define CRM_MISC2_HEXT_TO_SCLK_DIV_1        (0x2U << CRM_MISC2_HEXT_TO_SCLK_DIV_Pos) /*!< 0x00100000 */
#define CRM_MISC2_HEXT_TO_SCLK_DIV_2        (0x4U << CRM_MISC2_HEXT_TO_SCLK_DIV_Pos) /*!< 0x00200000 */

#define CRM_MISC2_HEXT_TO_SCLK_DIV_DIV1     0x00000000U                             /*!< HEXT */
#define CRM_MISC2_HEXT_TO_SCLK_DIV_DIV2     0x00080000U                             /*!< HEXT/2 */
#define CRM_MISC2_HEXT_TO_SCLK_DIV_DIV4     0x00100000U                             /*!< HEXT/4 */
#define CRM_MISC2_HEXT_TO_SCLK_DIV_DIV8     0x00180000U                             /*!< HEXT/8 */
#define CRM_MISC2_HEXT_TO_SCLK_DIV_DIV16    0x00200000U                             /*!< HEXT/16 */
#define CRM_MISC2_HEXT_TO_SCLK_DIV_DIV32    0x00280000U                             /*!< HEXT/32 */

/******************************************************************************/
/*                                                                            */
/*                Flash and User System Data Registers (FLASH)                */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_PSR register  ******************/
/*!< WTCYC congiguration */
#define FLASH_PSR_WTCYC_Pos                 (0U)
#define FLASH_PSR_WTCYC_Msk                 (0x7U << FLASH_PSR_WTCYC_Pos)           /*!< 0x00000007 */
#define FLASH_PSR_WTCYC                     FLASH_PSR_WTCYC_Msk                     /*!< WTCYC[2:0] bits (Wait cycle) */
#define FLASH_PSR_WTCYC_0                   (0x1U << FLASH_PSR_WTCYC_Pos)           /*!< 0x00000001 */
#define FLASH_PSR_WTCYC_1                   (0x2U << FLASH_PSR_WTCYC_Pos)           /*!< 0x00000002 */
#define FLASH_PSR_WTCYC_2                   (0x4U << FLASH_PSR_WTCYC_Pos)           /*!< 0x00000004 */

