qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402kx.h
#define SLIB_KEY_Pos                        (0U)
#define SLIB_KEY_Msk                        (0xA35F6D24U << SLIB_KEY_Pos)           /*!< 0xA35F6D24 */
#define SLIB_KEY                            SLIB_KEY_Msk                            /*!< Security library key */

/*----------------------------------------------------------------------------*/

/******************  Bit definition for FLASH_FAP register  *******************/
#define FLASH_FAP_FAP_Pos                   (0U)
#define FLASH_FAP_FAP_Msk                   (0xFFU << FLASH_FAP_FAP_Pos)            /*!< 0x000000FF */
#define FLASH_FAP_FAP                       FLASH_FAP_FAP_Msk                       /*!< Flash memory access protection */
#define FLASH_FAP_nFAP_Pos                  (8U)
#define FLASH_FAP_nFAP_Msk                  (0xFFU << FLASH_FAP_nFAP_Pos)           /*!< 0x0000FF00 */
#define FLASH_FAP_nFAP                      FLASH_FAP_nFAP_Msk                      /*!< Inverse code of flash memory access protection */

/******************  Bit definition for FLASH_SSB register  *******************/
#define FLASH_SSB_SSB_Pos                   (16U)
#define FLASH_SSB_SSB_Msk                   (0xFFU << FLASH_SSB_SSB_Pos)            /*!< 0x00FF0000 */
#define FLASH_SSB_SSB                       FLASH_SSB_SSB_Msk                       /*!< System configuration byte */
#define FLASH_SSB_nSSB_Pos                  (24U)
#define FLASH_SSB_nSSB_Msk                  (0xFFU << FLASH_SSB_nSSB_Pos)           /*!< 0xFF000000 */
#define FLASH_SSB_nSSB                      FLASH_SSB_nSSB_Msk                      /*!< Inverse code of system configuration byte */

/*****************  Bit definition for FLASH_DATA0 register  ******************/
#define FLASH_DATA0_DATA0_Pos               (0U)
#define FLASH_DATA0_DATA0_Msk               (0xFFU << FLASH_DATA0_DATA0_Pos)        /*!< 0x000000FF */
#define FLASH_DATA0_DATA0                   FLASH_DATA0_DATA0_Msk                   /*!< User data 0 */
#define FLASH_DATA0_nDATA0_Pos              (8U)
#define FLASH_DATA0_nDATA0_Msk              (0xFFU << FLASH_DATA0_nDATA0_Pos)       /*!< 0x0000FF00 */
#define FLASH_DATA0_nDATA0                  FLASH_DATA0_nDATA0_Msk                  /*!< Inverse code of user data 0 */

/*****************  Bit definition for FLASH_DATA1 register  ******************/
#define FLASH_DATA1_DATA1_Pos               (16U)
#define FLASH_DATA1_DATA1_Msk               (0xFFU << FLASH_DATA1_DATA1_Pos)        /*!< 0x00FF0000 */
#define FLASH_DATA1_DATA1                   FLASH_DATA1_DATA1_Msk                   /*!< User data 1 */
#define FLASH_DATA1_nDATA1_Pos              (24U)
#define FLASH_DATA1_nDATA1_Msk              (0xFFU << FLASH_DATA1_nDATA1_Pos)       /*!< 0xFF000000 */
#define FLASH_DATA1_nDATA1                  FLASH_DATA1_nDATA1_Msk                  /*!< Inverse code of user data 1 */

/******************  Bit definition for FLASH_EPP0 register  ******************/
#define FLASH_EPP0_EPP0_Pos                 (0U)
#define FLASH_EPP0_EPP0_Msk                 (0xFFU << FLASH_EPP0_EPP0_Pos)          /*!< 0x000000FF */
#define FLASH_EPP0_EPP0                     FLASH_EPP0_EPP0_Msk                     /*!< Flash erase/write protection byte 0 */
#define FLASH_EPP0_nEPP0_Pos                (8U)
#define FLASH_EPP0_nEPP0_Msk                (0xFFU << FLASH_EPP0_nEPP0_Pos)         /*!< 0x0000FF00 */
#define FLASH_EPP0_nEPP0                    FLASH_EPP0_nEPP0_Msk                    /*!< Inverse code of flash erase/write protection byte 0 */

/******************  Bit definition for FLASH_EPP1 register  ******************/
#define FLASH_EPP1_EPP1_Pos                 (16U)
#define FLASH_EPP1_EPP1_Msk                 (0xFFU << FLASH_EPP1_EPP1_Pos)          /*!< 0x00FF0000 */
#define FLASH_EPP1_EPP1                     FLASH_EPP1_EPP1_Msk                     /*!< Flash erase/write protection byte 1 */
#define FLASH_EPP1_nEPP1_Pos                (24U)
#define FLASH_EPP1_nEPP1_Msk                (0xFFU << FLASH_EPP1_nEPP1_Pos)         /*!< 0xFF000000 */
#define FLASH_EPP1_nEPP1                    FLASH_EPP1_nEPP1_Msk                    /*!< Inverse code of flash erase/write protection byte 1 */

/******************  Bit definition for FLASH_EPP2 register  ******************/
#define FLASH_EPP2_EPP2_Pos                 (0U)
#define FLASH_EPP2_EPP2_Msk                 (0xFFU << FLASH_EPP2_EPP2_Pos)          /*!< 0x000000FF */
#define FLASH_EPP2_EPP2                     FLASH_EPP2_EPP2_Msk                     /*!< Flash erase/write protection byte 2 */
#define FLASH_EPP2_nEPP2_Pos                (8U)
#define FLASH_EPP2_nEPP2_Msk                (0xFFU << FLASH_EPP2_nEPP2_Pos)         /*!< 0x0000FF00 */
#define FLASH_EPP2_nEPP2                    FLASH_EPP2_nEPP2_Msk                    /*!< Inverse code of flash erase/write protection byte 2 */

/******************  Bit definition for FLASH_EPP3 register  ******************/
#define FLASH_EPP3_EPP3_Pos                 (16U)
#define FLASH_EPP3_EPP3_Msk                 (0xFFU << FLASH_EPP3_EPP3_Pos)          /*!< 0x00FF0000 */
#define FLASH_EPP3_EPP3                     FLASH_EPP3_EPP3_Msk                     /*!< Flash erase/write protection byte 3 */
#define FLASH_EPP3_nEPP3_Pos                (24U)
#define FLASH_EPP3_nEPP3_Msk                (0xFFU << FLASH_EPP3_nEPP3_Pos)         /*!< 0xFF000000 */
#define FLASH_EPP3_nEPP3                    FLASH_EPP3_nEPP3_Msk                    /*!< Inverse code of flash erase/write protection byte 3 */

/****************  Bit definition for FLASH_QSPIKEY0 register  ****************/
#define FLASH_QSPIKEY0_QSPIKEY0_Pos         (0U)
#define FLASH_QSPIKEY0_QSPIKEY0_Msk         (0xFFU << FLASH_QSPIKEY0_QSPIKEY0_Pos)  /*!< 0x000000FF */
#define FLASH_QSPIKEY0_QSPIKEY0             FLASH_QSPIKEY0_QSPIKEY0_Msk             /*!< QSPI ciphertext access area encryption key byte 0 */
#define FLASH_QSPIKEY0_nQSPIKEY0_Pos        (8U)
#define FLASH_QSPIKEY0_nQSPIKEY0_Msk        (0xFFU << FLASH_QSPIKEY0_nQSPIKEY0_Pos) /*!< 0x0000FF00 */
#define FLASH_QSPIKEY0_nQSPIKEY0            FLASH_QSPIKEY0_nQSPIKEY0_Msk            /*!< Inverse code of QSPI ciphertext access area encryption key byte 0 */

