qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402kx.h
/*!< EXINT2 configuration */
#define SCFG_EXINTC1_EXINT2_Pos             (8U)
#define SCFG_EXINTC1_EXINT2_Msk             (0xFU << SCFG_EXINTC1_EXINT2_Pos)       /*!< 0x00000F00 */
#define SCFG_EXINTC1_EXINT2                 SCFG_EXINTC1_EXINT2_Msk                 /*!< EXINT2[3:0] bits (EXINT2 input source configuration) */

#define SCFG_EXINTC1_EXINT2_GPA             0x00000000U                             /*!< GPIOA pin 2 */
#define SCFG_EXINTC1_EXINT2_GPB_Pos         (8U)
#define SCFG_EXINTC1_EXINT2_GPB_Msk         (0x1U << SCFG_EXINTC1_EXINT2_GPB_Pos)   /*!< 0x00000100 */
#define SCFG_EXINTC1_EXINT2_GPB             SCFG_EXINTC1_EXINT2_GPB_Msk             /*!< GPIOB pin 2 */
#define SCFG_EXINTC1_EXINT2_GPC_Pos         (9U)
#define SCFG_EXINTC1_EXINT2_GPC_Msk         (0x1U << SCFG_EXINTC1_EXINT2_GPC_Pos)   /*!< 0x00000200 */
#define SCFG_EXINTC1_EXINT2_GPC             SCFG_EXINTC1_EXINT2_GPC_Msk             /*!< GPIOC pin 2 */
#define SCFG_EXINTC1_EXINT2_GPD_Pos         (8U)
#define SCFG_EXINTC1_EXINT2_GPD_Msk         (0x3U << SCFG_EXINTC1_EXINT2_GPD_Pos)   /*!< 0x00000300 */
#define SCFG_EXINTC1_EXINT2_GPD             SCFG_EXINTC1_EXINT2_GPD_Msk             /*!< GPIOD pin 2 */
#define SCFG_EXINTC1_EXINT2_GPF_Pos         (10U)
#define SCFG_EXINTC1_EXINT2_GPF_Msk         (0x1U << SCFG_EXINTC1_EXINT2_GPF_Pos)   /*!< 0x00000400 */
#define SCFG_EXINTC1_EXINT2_GPF             SCFG_EXINTC1_EXINT2_GPF_Msk             /*!< GPIOF pin 2 */

/*!< EXINT3 configuration */
#define SCFG_EXINTC1_EXINT3_Pos             (12U)
#define SCFG_EXINTC1_EXINT3_Msk             (0xFU << SCFG_EXINTC1_EXINT3_Pos)       /*!< 0x0000F000 */
#define SCFG_EXINTC1_EXINT3                 SCFG_EXINTC1_EXINT3_Msk                 /*!< EXINT3[3:0] bits (EXINT3 input source configuration) */

#define SCFG_EXINTC1_EXINT3_GPA             0x00000000U                             /*!< GPIOA pin 3 */
#define SCFG_EXINTC1_EXINT3_GPB_Pos         (12U)
#define SCFG_EXINTC1_EXINT3_GPB_Msk         (0x1U << SCFG_EXINTC1_EXINT3_GPB_Pos)   /*!< 0x00001000 */
#define SCFG_EXINTC1_EXINT3_GPB             SCFG_EXINTC1_EXINT3_GPB_Msk             /*!< GPIOB pin 3 */
#define SCFG_EXINTC1_EXINT3_GPC_Pos         (13U)
#define SCFG_EXINTC1_EXINT3_GPC_Msk         (0x1U << SCFG_EXINTC1_EXINT3_GPC_Pos)   /*!< 0x00002000 */
#define SCFG_EXINTC1_EXINT3_GPC             SCFG_EXINTC1_EXINT3_GPC_Msk             /*!< GPIOC pin 3 */
#define SCFG_EXINTC1_EXINT3_GPD_Pos         (12U)
#define SCFG_EXINTC1_EXINT3_GPD_Msk         (0x3U << SCFG_EXINTC1_EXINT3_GPD_Pos)   /*!< 0x00003000 */
#define SCFG_EXINTC1_EXINT3_GPD             SCFG_EXINTC1_EXINT3_GPD_Msk             /*!< GPIOD pin 3 */
#define SCFG_EXINTC1_EXINT3_GPF_Pos         (14U)
#define SCFG_EXINTC1_EXINT3_GPF_Msk         (0x1U << SCFG_EXINTC1_EXINT3_GPF_Pos)   /*!< 0x00004000 */
#define SCFG_EXINTC1_EXINT3_GPF             SCFG_EXINTC1_EXINT3_GPF_Msk             /*!< GPIOF pin 3 */

/*****************  Bit definition for SCFG_EXINTC2 register  *****************/
/*!< EXINT4 configuration */
#define SCFG_EXINTC2_EXINT4_Pos             (0U)
#define SCFG_EXINTC2_EXINT4_Msk             (0xFU << SCFG_EXINTC2_EXINT4_Pos)       /*!< 0x0000000F */
#define SCFG_EXINTC2_EXINT4                 SCFG_EXINTC2_EXINT4_Msk                 /*!< EXINT4[3:0] bits (EXINT4 input source configuration) */

#define SCFG_EXINTC2_EXINT4_GPA             0x00000000U                             /*!< GPIOA pin 4 */
#define SCFG_EXINTC2_EXINT4_GPB_Pos         (0U)
#define SCFG_EXINTC2_EXINT4_GPB_Msk         (0x1U << SCFG_EXINTC2_EXINT4_GPB_Pos)   /*!< 0x00000001 */
#define SCFG_EXINTC2_EXINT4_GPB             SCFG_EXINTC2_EXINT4_GPB_Msk             /*!< GPIOB pin 4 */
#define SCFG_EXINTC2_EXINT4_GPC_Pos         (1U)
#define SCFG_EXINTC2_EXINT4_GPC_Msk         (0x1U << SCFG_EXINTC2_EXINT4_GPC_Pos)   /*!< 0x00000002 */
#define SCFG_EXINTC2_EXINT4_GPC             SCFG_EXINTC2_EXINT4_GPC_Msk             /*!< GPIOC pin 4 */
#define SCFG_EXINTC2_EXINT4_GPD_Pos         (0U)
#define SCFG_EXINTC2_EXINT4_GPD_Msk         (0x3U << SCFG_EXINTC2_EXINT4_GPD_Pos)   /*!< 0x00000003 */
#define SCFG_EXINTC2_EXINT4_GPD             SCFG_EXINTC2_EXINT4_GPD_Msk             /*!< GPIOD pin 4 */
#define SCFG_EXINTC2_EXINT4_GPF_Pos         (2U)
#define SCFG_EXINTC2_EXINT4_GPF_Msk         (0x1U << SCFG_EXINTC2_EXINT4_GPF_Pos)   /*!< 0x00000004 */
#define SCFG_EXINTC2_EXINT4_GPF             SCFG_EXINTC2_EXINT4_GPF_Msk             /*!< GPIOF pin 4 */

/* EXINT5 configuration */
#define SCFG_EXINTC2_EXINT5_Pos             (4U)
#define SCFG_EXINTC2_EXINT5_Msk             (0xFU << SCFG_EXINTC2_EXINT5_Pos)       /*!< 0x000000F0 */
#define SCFG_EXINTC2_EXINT5                 SCFG_EXINTC2_EXINT5_Msk                 /*!< EXINT5[3:0] bits (EXINT5 input source configuration) */

#define SCFG_EXINTC2_EXINT5_GPA             0x00000000U                             /*!< GPIOA pin 5 */
#define SCFG_EXINTC2_EXINT5_GPB_Pos         (4U)
#define SCFG_EXINTC2_EXINT5_GPB_Msk         (0x1U << SCFG_EXINTC2_EXINT5_GPB_Pos)   /*!< 0x00000010 */
#define SCFG_EXINTC2_EXINT5_GPB             SCFG_EXINTC2_EXINT5_GPB_Msk             /*!< GPIOB pin 5 */
#define SCFG_EXINTC2_EXINT5_GPC_Pos         (5U)
#define SCFG_EXINTC2_EXINT5_GPC_Msk         (0x1U << SCFG_EXINTC2_EXINT5_GPC_Pos)   /*!< 0x00000020 */
#define SCFG_EXINTC2_EXINT5_GPC             SCFG_EXINTC2_EXINT5_GPC_Msk             /*!< GPIOC pin 5 */
#define SCFG_EXINTC2_EXINT5_GPD_Pos         (4U)
#define SCFG_EXINTC2_EXINT5_GPD_Msk         (0x3U << SCFG_EXINTC2_EXINT5_GPD_Pos)   /*!< 0x00000030 */
#define SCFG_EXINTC2_EXINT5_GPD             SCFG_EXINTC2_EXINT5_GPD_Msk             /*!< GPIOD pin 5 */
#define SCFG_EXINTC2_EXINT5_GPF_Pos         (6U)
#define SCFG_EXINTC2_EXINT5_GPF_Msk         (0x1U << SCFG_EXINTC2_EXINT5_GPF_Pos)   /*!< 0x00000040 */
#define SCFG_EXINTC2_EXINT5_GPF             SCFG_EXINTC2_EXINT5_GPF_Msk             /*!< GPIOF pin 5 */

/*!< EXINT6 configuration */
#define SCFG_EXINTC2_EXINT6_Pos             (8U)
#define SCFG_EXINTC2_EXINT6_Msk             (0xFU << SCFG_EXINTC2_EXINT6_Pos)       /*!< 0x00000F00 */
#define SCFG_EXINTC2_EXINT6                 SCFG_EXINTC2_EXINT6_Msk                 /*!< EXINT6[3:0] bits (EXINT6 input source configuration) */

