qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402kx.h
#define I2C_OADDR1_ADDR1_0_Pos              (0U)
#define I2C_OADDR1_ADDR1_0_Msk              (0x1U << I2C_OADDR1_ADDR1_0_Pos)        /*!< 0x00000001 */
#define I2C_OADDR1_ADDR1_0                  I2C_OADDR1_ADDR1_0_Msk                  /*!< Bit 0 */
#define I2C_OADDR1_ADDR1_1_Pos              (1U)
#define I2C_OADDR1_ADDR1_1_Msk              (0x1U << I2C_OADDR1_ADDR1_1_Pos)        /*!< 0x00000002 */
#define I2C_OADDR1_ADDR1_1                  I2C_OADDR1_ADDR1_1_Msk                  /*!< Bit 1 */
#define I2C_OADDR1_ADDR1_2_Pos              (2U)
#define I2C_OADDR1_ADDR1_2_Msk              (0x1U << I2C_OADDR1_ADDR1_2_Pos)        /*!< 0x00000004 */
#define I2C_OADDR1_ADDR1_2                  I2C_OADDR1_ADDR1_2_Msk                  /*!< Bit 2 */
#define I2C_OADDR1_ADDR1_3_Pos              (3U)
#define I2C_OADDR1_ADDR1_3_Msk              (0x1U << I2C_OADDR1_ADDR1_3_Pos)        /*!< 0x00000008 */
#define I2C_OADDR1_ADDR1_3                  I2C_OADDR1_ADDR1_3_Msk                  /*!< Bit 3 */
#define I2C_OADDR1_ADDR1_4_Pos              (4U)
#define I2C_OADDR1_ADDR1_4_Msk              (0x1U << I2C_OADDR1_ADDR1_4_Pos)        /*!< 0x00000010 */
#define I2C_OADDR1_ADDR1_4                  I2C_OADDR1_ADDR1_4_Msk                  /*!< Bit 4 */
#define I2C_OADDR1_ADDR1_5_Pos              (5U)
#define I2C_OADDR1_ADDR1_5_Msk              (0x1U << I2C_OADDR1_ADDR1_5_Pos)        /*!< 0x00000020 */
#define I2C_OADDR1_ADDR1_5                  I2C_OADDR1_ADDR1_5_Msk                  /*!< Bit 5 */
#define I2C_OADDR1_ADDR1_6_Pos              (6U)
#define I2C_OADDR1_ADDR1_6_Msk              (0x1U << I2C_OADDR1_ADDR1_6_Pos)        /*!< 0x00000040 */
#define I2C_OADDR1_ADDR1_6                  I2C_OADDR1_ADDR1_6_Msk                  /*!< Bit 6 */
#define I2C_OADDR1_ADDR1_7_Pos              (7U)
#define I2C_OADDR1_ADDR1_7_Msk              (0x1U << I2C_OADDR1_ADDR1_7_Pos)        /*!< 0x00000080 */
#define I2C_OADDR1_ADDR1_7                  I2C_OADDR1_ADDR1_7_Msk                  /*!< Bit 7 */
#define I2C_OADDR1_ADDR1_8_Pos              (8U)
#define I2C_OADDR1_ADDR1_8_Msk              (0x1U << I2C_OADDR1_ADDR1_8_Pos)        /*!< 0x00000100 */
#define I2C_OADDR1_ADDR1_8                  I2C_OADDR1_ADDR1_8_Msk                  /*!< Bit 8 */
#define I2C_OADDR1_ADDR1_9_Pos              (9U)
#define I2C_OADDR1_ADDR1_9_Msk              (0x1U << I2C_OADDR1_ADDR1_9_Pos)        /*!< 0x00000200 */
#define I2C_OADDR1_ADDR1_9                  I2C_OADDR1_ADDR1_9_Msk                  /*!< Bit 9 */

#define I2C_OADDR1_ADDR1MODE_Pos            (10U)
#define I2C_OADDR1_ADDR1MODE_Msk            (0x1U << I2C_OADDR1_ADDR1MODE_Pos)      /*!< 0x00000400 */
#define I2C_OADDR1_ADDR1MODE                I2C_OADDR1_ADDR1MODE_Msk                /*!< Own Address 1 mode */
#define I2C_OADDR1_ADDR1EN_Pos              (15U)
#define I2C_OADDR1_ADDR1EN_Msk              (0x1U << I2C_OADDR1_ADDR1EN_Pos)        /*!< 0x00008000 */
#define I2C_OADDR1_ADDR1EN                  I2C_OADDR1_ADDR1EN_Msk                  /*!< Own Address 1 enable */

/******************  Bit definition for I2C_OADDR2 register  ******************/
#define I2C_OADDR2_ADDR2_Pos                (1U)
#define I2C_OADDR2_ADDR2_Msk                (0x7FU << I2C_OADDR2_ADDR2_Pos)         /*!< 0x000000FE */
#define I2C_OADDR2_ADDR2                    I2C_OADDR2_ADDR2_Msk                    /*!< Own address 2 */

/*!< ADDR2MASK configuration */
#define I2C_OADDR2_ADDR2MASK_Pos            (8U)
#define I2C_OADDR2_ADDR2MASK_Msk            (0x7U << I2C_OADDR2_ADDR2MASK_Pos)      /*!< 0x00000700 */
#define I2C_OADDR2_ADDR2MASK                I2C_OADDR2_ADDR2MASK_Msk                /*!< CNT[2:0] bits (Own address 2 bit mask) */
#define I2C_OADDR2_ADDR2MASK_0              (0x01U << I2C_OADDR2_ADDR2MASK_Pos)     /*!< 0x00000100 */
#define I2C_OADDR2_ADDR2MASK_1              (0x02U << I2C_OADDR2_ADDR2MASK_Pos)     /*!< 0x00000200 */
#define I2C_OADDR2_ADDR2MASK_2              (0x04U << I2C_OADDR2_ADDR2MASK_Pos)     /*!< 0x00000400 */

#define I2C_OADDR2_ADDR2EN_Pos              (15U)
#define I2C_OADDR2_ADDR2EN_Msk              (0x1U << I2C_OADDR2_ADDR2EN_Pos)        /*!< 0x00008000 */
#define I2C_OADDR2_ADDR2EN                  I2C_OADDR2_ADDR2EN_Msk                  /*!< Own Address 2 enable */

/*****************  Bit definition for I2C_CLKCTRL register  ******************/
#define I2C_CLKCTRL_SCLL_Pos                (0U)
#define I2C_CLKCTRL_SCLL_Msk                (0xFFU << I2C_CLKCTRL_SCLL_Pos)         /*!< 0x000000FF */
#define I2C_CLKCTRL_SCLL                    I2C_CLKCTRL_SCLL_Msk                    /*!< SCL low level */
#define I2C_CLKCTRL_SCLH_Pos                (8U)
#define I2C_CLKCTRL_SCLH_Msk                (0xFFU << I2C_CLKCTRL_SCLH_Pos)         /*!< 0x0000FF00 */
#define I2C_CLKCTRL_SCLH                    I2C_CLKCTRL_SCLH_Msk                    /*!< SCL high level */
#define I2C_CLKCTRL_SDAD_Pos                (16U)
#define I2C_CLKCTRL_SDAD_Msk                (0xFU << I2C_CLKCTRL_SDAD_Pos)          /*!< 0x000F0000 */
#define I2C_CLKCTRL_SDAD                    I2C_CLKCTRL_SDAD_Msk                    /*!< SDA output delay */
#define I2C_CLKCTRL_SCLD_Pos                (20U)
#define I2C_CLKCTRL_SCLD_Msk                (0xFU << I2C_CLKCTRL_SCLD_Pos)          /*!< 0x00F00000 */
#define I2C_CLKCTRL_SCLD                    I2C_CLKCTRL_SCLD_Msk                    /*!< SCL output delay */
#define I2C_CLKCTRL_DIVH_Pos                (24U)
#define I2C_CLKCTRL_DIVH_Msk                (0xFU << I2C_CLKCTRL_DIVH_Pos)          /*!< 0x0F000000 */
#define I2C_CLKCTRL_DIVH                    I2C_CLKCTRL_DIVH_Msk                    /*!< High 4 bits of clock divider value */
#define I2C_CLKCTRL_DIVL_Pos                (28U)
#define I2C_CLKCTRL_DIVL_Msk                (0xFU << I2C_CLKCTRL_DIVL_Pos)          /*!< 0xF0000000 */
#define I2C_CLKCTRL_DIVL                    I2C_CLKCTRL_DIVL_Msk                    /*!< Low 4 bits of clock divider value */

/*****************  Bit definition for I2C_TIMEOUT register  ******************/
#define I2C_TIMEOUT_TOTIME_Pos              (0U)
#define I2C_TIMEOUT_TOTIME_Msk              (0xFFFU << I2C_TIMEOUT_TOTIME_Pos)      /*!< 0x00000FFF */
#define I2C_TIMEOUT_TOTIME                  I2C_TIMEOUT_TOTIME_Msk                  /*!< Clock timeout detection time */
#define I2C_TIMEOUT_TOMODE_Pos              (12U)
#define I2C_TIMEOUT_TOMODE_Msk              (0x1U << I2C_TIMEOUT_TOMODE_Pos)        /*!< 0x00001000 */
#define I2C_TIMEOUT_TOMODE                  I2C_TIMEOUT_TOMODE_Msk                  /*!< Clock timeout detection mode */
#define I2C_TIMEOUT_TOEN_Pos                (15U)
#define I2C_TIMEOUT_TOEN_Msk                (0x1U << I2C_TIMEOUT_TOEN_Pos)          /*!< 0x00008000 */
#define I2C_TIMEOUT_TOEN                    I2C_TIMEOUT_TOEN_Msk                    /*!< Detect clock low/high timeout enable */
#define I2C_TIMEOUT_EXTTIME_Pos             (16U)
#define I2C_TIMEOUT_EXTTIME_Msk             (0xFFFU << I2C_TIMEOUT_EXTTIME_Pos)     /*!< 0x0FFF0000 */
#define I2C_TIMEOUT_EXTTIME                 I2C_TIMEOUT_EXTTIME_Msk                 /*!< Cumulative clock low extend timeout value */
#define I2C_TIMEOUT_EXTEN_Pos               (31U)
#define I2C_TIMEOUT_EXTEN_Msk               (0x1U << I2C_TIMEOUT_EXTEN_Pos)         /*!< 0x80000000 */
#define I2C_TIMEOUT_EXTEN                   I2C_TIMEOUT_EXTEN_Msk                   /*!< Cumulative clock low extend timeout enable */

