qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402kx.h
/*!< PSN3 configuration */
#define ADC_PSQ_PSN3_Pos                    (10U)
#define ADC_PSQ_PSN3_Msk                    (0x1FU << ADC_PSQ_PSN3_Pos)             /*!< 0x00007C00 */
#define ADC_PSQ_PSN3                        ADC_PSQ_PSN3_Msk                        /*!< PSN3[4:0] bits (Number of 3rd conversion in preempted sequence) */
#define ADC_PSQ_PSN3_0                      (0x01U << ADC_PSQ_PSN3_Pos)             /*!< 0x00000400 */
#define ADC_PSQ_PSN3_1                      (0x02U << ADC_PSQ_PSN3_Pos)             /*!< 0x00000800 */
#define ADC_PSQ_PSN3_2                      (0x04U << ADC_PSQ_PSN3_Pos)             /*!< 0x00001000 */
#define ADC_PSQ_PSN3_3                      (0x08U << ADC_PSQ_PSN3_Pos)             /*!< 0x00002000 */
#define ADC_PSQ_PSN3_4                      (0x10U << ADC_PSQ_PSN3_Pos)             /*!< 0x00004000 */

/*!< PSN4 configuration */
#define ADC_PSQ_PSN4_Pos                    (15U)
#define ADC_PSQ_PSN4_Msk                    (0x1FU << ADC_PSQ_PSN4_Pos)             /*!< 0x000F8000 */
#define ADC_PSQ_PSN4                        ADC_PSQ_PSN4_Msk                        /*!< PSN4[4:0] bits (Number of 4th conversion in preempted sequence) */
#define ADC_PSQ_PSN4_0                      (0x01U << ADC_PSQ_PSN4_Pos)             /*!< 0x00008000 */
#define ADC_PSQ_PSN4_1                      (0x02U << ADC_PSQ_PSN4_Pos)             /*!< 0x00010000 */
#define ADC_PSQ_PSN4_2                      (0x04U << ADC_PSQ_PSN4_Pos)             /*!< 0x00020000 */
#define ADC_PSQ_PSN4_3                      (0x08U << ADC_PSQ_PSN4_Pos)             /*!< 0x00040000 */
#define ADC_PSQ_PSN4_4                      (0x10U << ADC_PSQ_PSN4_Pos)             /*!< 0x00080000 */

/*!< PCLEN configuration */
#define ADC_PSQ_PCLEN_Pos                   (20U)
#define ADC_PSQ_PCLEN_Msk                   (0x3U << ADC_PSQ_PCLEN_Pos)             /*!< 0x00300000 */
#define ADC_PSQ_PCLEN                       ADC_PSQ_PCLEN_Msk                       /*!< PCLEN[1:0] bits (Preempted conversion sequence length) */
#define ADC_PSQ_PCLEN_0                     (0x1U << ADC_PSQ_PCLEN_Pos)             /*!< 0x00100000 */
#define ADC_PSQ_PCLEN_1                     (0x2U << ADC_PSQ_PCLEN_Pos)             /*!< 0x00200000 */

/*******************  Bit definition for ADC_PDT1 register  *******************/
#define ADC_PDT1_PDT1_Pos                   (0U)
#define ADC_PDT1_PDT1_Msk                   (0xFFFFU << ADC_PDT1_PDT1_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT1_PDT1                       ADC_PDT1_PDT1_Msk                       /*!< Conversion data from preempted channel 1 */

/*******************  Bit definition for ADC_PDT2 register  *******************/
#define ADC_PDT2_PDT2_Pos                   (0U)
#define ADC_PDT2_PDT2_Msk                   (0xFFFFU << ADC_PDT2_PDT2_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT2_PDT2                       ADC_PDT2_PDT2_Msk                       /*!< Conversion data from preempted channel 2 */

/*******************  Bit definition for ADC_PDT3 register  *******************/
#define ADC_PDT3_PDT3_Pos                   (0U)
#define ADC_PDT3_PDT3_Msk                   (0xFFFFU << ADC_PDT3_PDT3_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT3_PDT3                       ADC_PDT3_PDT3_Msk                       /*!< Conversion data from preempted channel 3 */

/*******************  Bit definition for ADC_PDT4 register  *******************/
#define ADC_PDT4_PDT4_Pos                   (0U)
#define ADC_PDT4_PDT4_Msk                   (0xFFFFU << ADC_PDT4_PDT4_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT4_PDT4                       ADC_PDT4_PDT4_Msk                       /*!< Conversion data from preempted channel 4 */

/*******************  Bit definition for ADC_ODT register  ********************/
#define ADC_ODT_ODT_Pos                     (0U)
#define ADC_ODT_ODT_Msk                     (0xFFFFU << ADC_ODT_ODT_Pos)            /*!< 0x0000FFFF */
#define ADC_ODT_ODT                         ADC_ODT_ODT_Msk                         /*!< Conversion data of ordinary channel */

/*******************  Bit definition for ADC_OVSP register  *******************/
#define ADC_OVSP_OOSEN_Pos                  (0U)
#define ADC_OVSP_OOSEN_Msk                  (0x1U << ADC_OVSP_OOSEN_Pos)            /*!< 0x00000001 */
#define ADC_OVSP_OOSEN                      ADC_OVSP_OOSEN_Msk                      /*!< Ordinary oversampling enable */
#define ADC_OVSP_POSEN_Pos                  (1U)
#define ADC_OVSP_POSEN_Msk                  (0x1U << ADC_OVSP_POSEN_Pos)            /*!< 0x00000002 */
#define ADC_OVSP_POSEN                      ADC_OVSP_POSEN_Msk                      /*!< Preempted oversampling enable */

/*!< OSRSEL configuration */
#define ADC_OVSP_OSRSEL_Pos                 (2U)
#define ADC_OVSP_OSRSEL_Msk                 (0x7U << ADC_OVSP_OSRSEL_Pos)           /*!< 0x0000001C */
#define ADC_OVSP_OSRSEL                     ADC_OVSP_OSRSEL_Msk                     /*!< OSRSEL[2:0] bits (Oversampling ratio select) */
#define ADC_OVSP_OSRSEL_0                   (0x1U << ADC_OVSP_OSRSEL_Pos)           /*!< 0x00000004 */
#define ADC_OVSP_OSRSEL_1                   (0x2U << ADC_OVSP_OSRSEL_Pos)           /*!< 0x00000008 */
#define ADC_OVSP_OSRSEL_2                   (0x4U << ADC_OVSP_OSRSEL_Pos)           /*!< 0x00000010 */

#define ADC_OVSP_OSRSEL_MULTI2              0x00000000U                             /*!< 2x */
#define ADC_OVSP_OSRSEL_MULTI4              0x00000004U                             /*!< 4x */
#define ADC_OVSP_OSRSEL_MULTI8              0x00000008U                             /*!< 8x */
#define ADC_OVSP_OSRSEL_MULTI16             0x0000000CU                             /*!< 16x */
#define ADC_OVSP_OSRSEL_MULTI32             0x00000010U                             /*!< 32x */
#define ADC_OVSP_OSRSEL_MULTI64             0x00000014U                             /*!< 64x */
#define ADC_OVSP_OSRSEL_MULTI128            0x00000018U                             /*!< 128x */
#define ADC_OVSP_OSRSEL_MULTI256            0x0000001CU                             /*!< 256x */

/*!< OSSSEL configuration */
#define ADC_OVSP_OSSSEL_Pos                 (5U)
#define ADC_OVSP_OSSSEL_Msk                 (0xFU << ADC_OVSP_OSSSEL_Pos)           /*!< 0x000001E0 */
#define ADC_OVSP_OSSSEL                     ADC_OVSP_OSSSEL_Msk                     /*!< OSSSEL[3:0] bits (Oversampling shift select) */
#define ADC_OVSP_OSSSEL_0                   (0x1U << ADC_OVSP_OSSSEL_Pos)           /*!< 0x00000020 */
#define ADC_OVSP_OSSSEL_1                   (0x2U << ADC_OVSP_OSSSEL_Pos)           /*!< 0x00000040 */
#define ADC_OVSP_OSSSEL_2                   (0x4U << ADC_OVSP_OSSSEL_Pos)           /*!< 0x00000080 */
#define ADC_OVSP_OSSSEL_3                   (0x8U << ADC_OVSP_OSSSEL_Pos)           /*!< 0x00000100 */

#define ADC_OVSP_OSSSEL_NOSHIFT             0x00000000U                             /*!< No shift */
#define ADC_OVSP_OSSSEL_SHIFT1              0x00000020U                             /*!< Shift 1 bit */
#define ADC_OVSP_OSSSEL_SHIFT2              0x00000040U                             /*!< Shift 2 bit */
#define ADC_OVSP_OSSSEL_SHIFT3              0x00000060U                             /*!< Shift 3 bit */
#define ADC_OVSP_OSSSEL_SHIFT4              0x00000080U                             /*!< Shift 4 bit */
#define ADC_OVSP_OSSSEL_SHIFT5              0x000000A0U                             /*!< Shift 5 bit */
#define ADC_OVSP_OSSSEL_SHIFT6              0x000000C0U                             /*!< Shift 6 bit */
#define ADC_OVSP_OSSSEL_SHIFT7              0x000000E0U                             /*!< Shift 7 bit */
#define ADC_OVSP_OSSSEL_SHIFT8              0x00000100U                             /*!< Shift 8 bit */

#define ADC_OVSP_OOSTREN_Pos                (9U)
#define ADC_OVSP_OOSTREN_Msk                (0x1U << ADC_OVSP_OOSTREN_Pos)          /*!< 0x00000200 */
#define ADC_OVSP_OOSTREN                    ADC_OVSP_OOSTREN_Msk                    /*!< Ordinary oversampling trigger mode enable */
#define ADC_OVSP_OOSRSEL_Pos                (10U)
#define ADC_OVSP_OOSRSEL_Msk                (0x1U << ADC_OVSP_OOSRSEL_Pos)          /*!< 0x00000400 */
#define ADC_OVSP_OOSRSEL                    ADC_OVSP_OOSRSEL_Msk                    /*!< Ordinary oversampling restart mode select */

/******************  Bit definition for ADC_CCTRL register  *******************/
/*!< ADCDIV configuration */
#define ADC_CCTRL_ADCDIV_Pos                (16U)
#define ADC_CCTRL_ADCDIV_Msk                (0xFU << ADC_CCTRL_ADCDIV_Pos)          /*!< 0x000F0000 */
#define ADC_CCTRL_ADCDIV                    ADC_CCTRL_ADCDIV_Msk                    /*!< ADCDIV[3:0] bits (ADC division) */
#define ADC_CCTRL_ADCDIV_0                  (0x1U << ADC_CCTRL_ADCDIV_Pos)          /*!< 0x00010000 */
#define ADC_CCTRL_ADCDIV_1                  (0x2U << ADC_CCTRL_ADCDIV_Pos)          /*!< 0x00020000 */
#define ADC_CCTRL_ADCDIV_2                  (0x4U << ADC_CCTRL_ADCDIV_Pos)          /*!< 0x00040000 */
#define ADC_CCTRL_ADCDIV_3                  (0x8U << ADC_CCTRL_ADCDIV_Pos)          /*!< 0x00080000 */

#define ADC_CCTRL_ADCDIV_DIV2               0x00000000U                             /*!< HCLK/2 */
#define ADC_CCTRL_ADCDIV_DIV3               0x00010000U                             /*!< HCLK/3 */
#define ADC_CCTRL_ADCDIV_DIV4               0x00020000U                             /*!< HCLK/4 */
#define ADC_CCTRL_ADCDIV_DIV5               0x00030000U                             /*!< HCLK/5 */
#define ADC_CCTRL_ADCDIV_DIV6               0x00040000U                             /*!< HCLK/6 */
#define ADC_CCTRL_ADCDIV_DIV7               0x00050000U                             /*!< HCLK/7 */
#define ADC_CCTRL_ADCDIV_DIV8               0x00060000U                             /*!< HCLK/8 */
#define ADC_CCTRL_ADCDIV_DIV9               0x00070000U                             /*!< HCLK/9 */
#define ADC_CCTRL_ADCDIV_DIV10              0x00080000U                             /*!< HCLK/10 */
#define ADC_CCTRL_ADCDIV_DIV11              0x00090000U                             /*!< HCLK/11 */
#define ADC_CCTRL_ADCDIV_DIV12              0x000A0000U                             /*!< HCLK/12 */
#define ADC_CCTRL_ADCDIV_DIV13              0x000B0000U                             /*!< HCLK/13 */
#define ADC_CCTRL_ADCDIV_DIV14              0x000C0000U                             /*!< HCLK/14 */
#define ADC_CCTRL_ADCDIV_DIV15              0x000D0000U                             /*!< HCLK/15 */
#define ADC_CCTRL_ADCDIV_DIV16              0x000E0000U                             /*!< HCLK/16 */
#define ADC_CCTRL_ADCDIV_DIV17              0x000F0000U                             /*!< HCLK/17 */

/******************************************************************************/
/*                                                                            */
/*                       Controller Area Network (CAN)                        */
/*                                                                            */
/******************************************************************************/

